// © Copyright 2010, 2015-2016 HP Development Company, L.P.

TaskName = "Сканирование на компьютер";

// Restore alert message
"RESTORE_TITLE" = "Действительно восстановить параметры?";
"RESTORE_MSG" = "Если продолжить, будет восстановлено исходное состояние всех ярлыков сканирования. Нажмите кнопку \"Отмена\", чтобы оставить ярлыки без изменения, или кнопку \"Восстановить\", чтобы восстановить заводские параметры ярлыков.";
"RESTORE_BUTTON_TITLE" = "Восстановить";

"DEFAULT_TASK_CAPTION" = "Имя задачи:";
"DONE" = "Готово";

// Task not found alert message
"TASK_NOT_FOUND_TITLE" = "Задача недоступна";
"TASK_NOT_FOUND_DESC" = "Найденная на устройстве задача \"%@\" недоступна на компьютере. Выберите другую задачу.";

// Copy workflows fail alert message
"COPY_WORKFLOWS_TITLE" = "Сбой копирования рабочего процесса";
"COPY_WORKFLOWS_DESC" = "Не удалось скопировать рабочие процессы в папку домена устройства пользователя";

"DEVICE_NOT_FOUND_TITLE" = "Устройство не найдено";
"DEVICE_NOT_FOUND_DESC" = "Проблема при взаимодействии с устройством. Убедитесь, что устройство включено и правильно подключено, а затем повторите попытку.";

"COMPUTER_NAME_INFO_TITLE" = "Поле \"Имя компьютера\" используется для ввода имени компьютера, которое будет отображаться на устройстве HP."; //title for the Computer name info sheet
"COMPUTER_NAME_INFO_DESC" = "Количество символов, которое можно ввести, зависит от устройства.";

"UNKNOWN_ERROR_TITLE" = "Неизвестная ошибка";
"UNKNOWN_ERROR_DESC" = "При обновлении устройства произошла неизвестная ошибка. Убедитесь, что устройство включено и правильно подключено.";

"OK" = "OK";
"CANCEL" = "Отмена";

"MOREINFO_TITLE" = "Дополнительные сведения";

// The following strings are displayed in SSMTaskController nib file

"SSM_TITLE" = "Диспетчер ярлыков сканирования"; // Title
"SSM_SHORT_DESC" = "Ярлыки сканирования используются для выполнения стандартных задач сканирования с помощью элементов управления на передней панели устройства HP."; // short description
"YOUR_COMPUTER_NAME" = "Имя компьютера:"; // displayed if device is connected through n/w
"CHANGE_BTN_TITLE" = "Изменить...";
"MORE_INFO_BTN_TITLE" = "Сведения...";
"RESTORE_BTN_TITLE" = "Восстановить умолчания";
"TEST_BTN_TITLE" = "Проверка...";
"EDIT_BTN_TITLE" = "Правка...";

// Error Messages
"ERROR_PERMISSION_DENIED" = "Недостаточно прав доступа к папке \"%@\". Для просмотра или изменения прав доступа выберите элемент с помощью Finder, затем выберите File > Get Info (Файл > Получить сведения)."; // used from HPWFM, no need to get the localized string from customer.

// generic error
"ERROR" = "Ошибка";
"ERROR_UNKNOWN_DESC" = "Произошла неизвестная ошибка.";

// Error when workflow not found when user clicks on front panel scan
"ERROR_SHORTCUT_NOT_FOUND_TITLE" = "Ярлык не найден";
"ERROR_SHORTCUT_NOT_FOUND_DESC" = "Не удалось найти ярлык %1$@ устройства %2$@. Установите программное обеспечение еще раз.";

// Error displayed when HPScanWorkflow object creation fails for execution of workflow in SEH interface execute method
"ERROR_WORKFLOW_CREATE_FAIL_TITLE" = "Ошибка создания рабочего процесса";
"ERROR_WORKFLOW_CREATE_FAIL_DESC" = "При создании рабочего процесса произошла неизвестная ошибка. Повторите попытку.";

// Error displayed when copyworkflows fails as due to non availability of permission at user device domain folder
"ERROR_CREATING_DIR_TITLE" = "Ошибка создания каталога";
"ERROR_CREATING_DIR_DESC" = "Ошибка создания каталога %@. Проверьте права доступа к родительской папке и повторите попытку";

// Error displayed when workflow does not exists when user tries to open the same in Automator
"ERROR_OPENING_WORKFLOW_IN_AUTOMATOR_DESC" = "Ошибка при открытии рабочего процесса “%@” в программе Automator. Рабочий процесс не найден в исходном расположении.";

// New additions: 3/1/2010

// Error displayed when scan link ID received from the device is invalid
"ERROR_INVALID_SCAN_LINK_ID_TITLE" = "Ярлык сканирования не поддерживается";
"ERROR_INVALID_SCAN_LINK_ID_DESC" = "Выбранный ярлык сканирования нельзя использовать, пока он не будет распознан программным обеспечением. Выберите другой ярлык сканирования и повторите попытку.";

// Tool tips for change, edit and test button
"TIP_FOR_CHANGE_BTN" = "Щелкните, чтобы изменить имя компьютера";
"TIP_FOR_EDIT_BTN" = "Редактировать выбранную задачу";
"TIP_FOR_TEST_BTN" = "Запустить выбранную задачу";

// New additions: 3/1/2010

// Opt-in/Opt-out strings
"COMPUTER_NAME_TITLE" = "Имя компьютера:";
"COMPUTER_NAME_DESCRIPTION" = "При запуске сканирования с устройства HP может быть предложено выбрать компьютер из списка компьютеров, поддерживающих функцию сканирования на компьютер.";
"COMPUTER" = "Компьютер";
"COMPUTERS" = "Компьютеры";

"COMMUNICATION_ERROR" = "Не удается установить соединение со сканером. Убедитесь, что устройство включено, проверьте подключение и убедитесь, что сеть работает правильно. На устройстве должна быть включена служба Bonjour.";
"INSTALLATION_ERROR" = "Программное обеспечение HP, необходимое для сканирования, не найдено. Загрузите и установите последнюю версию рекомендованного программного обеспечения HP на ваше устройство по адресу http://www.hp.com/support и повторите попытку.";

"SCAN_TO_COMPUTER_CANNOT_BE_ENABLED" = "Невозможно включить функцию сканирования на компьютер";
"SCAN_TO_COMPUTER_DESCRIPTION" = "Функция сканирования на компьютер позволяет запускать сканирование с передней панели устройства HP и автоматически отправлять результаты сканирования на компьютер.";

HSDScanActionNotFoundTitle = "Не удается определить местоположение задачи сканирования";
HSDScanActionNotFoundDescription = "Задача сканирования не зарегистрирована. Запустите приложение сканирования HP Scan, находящееся в папке \"%@\" для автоматической регистрации задачи сканирования.";
